# Data wrangling

Data wrangling is a broad term used, often informally, to describe the process of
transforming raw data to a clean and organized format ready for use. For us, data
wrangling is only one step in preprocessing our data, but it is an important step.

The most common data structure used to “wrangle” data is the data frame, which can
be both intuitive and incredibly versatile. Data frames are tabular, meaning that they
are based on rows and columns like you would see in a spreadsheet

**[To Know More About Markdown Latext](https://csrgxtu.github.io/2015/03/20/Writing-Mathematic-Fomulars-in-Markdown/)**

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn
import scipy

# Load CSV File

In [6]:
# Read CSV files by making one column as index
# data_frame = pd.read_csv('dataset/circle_employee.csv', index_col='name') 

df = pd.read_csv('dataset/circle_employee.csv')
df.head()

,id,name,age,blood_group,gender,experience,designation,salary
0,1,Sharif,NaN,B+,male,1.5,Jr Software Engineer,30000
1,2,Kanan Mahmud,28.0,NaN,Male,7.5,Sr Software Engineer,80000
2,3,Md. Shakil,27.0,B-,Male,3.5,Software Engineer,45000
3,4,Imran Sheikh,25.0,B-,Male,1.8,Jr Software Engineer,30000
4,5,Farsan Rashid,27.0,O+,Male,4.2,Software Engineer,55000

# Create Dataframe

### Using List

In [7]:
dataframe = pd.DataFrame()

dataframe['Name'] = ['Sharif','Imran','Hanif','Akib','Fatin']
dataframe['Age'] = [26,24,np.nan,23,25]
dataframe['Blood Group'] = ['B+','O+','AB+','A+','O-']
dataframe['Sex Code'] = [1,1,1,1,1,]

dataframe

     Name   Age Blood Group  Sex Code
0  Sharif  26.0          B+         1
1   Imran  24.0          O+         1
2   Hanif   NaN         AB+         1
3    Akib  23.0          A+         1
4   Fatin  25.0          O-         1

### Using Dictionary

In [8]:
dct = {
    "name":['Sharif','Imran','Hanif','Akib','Fatin'],
    "Age":[26,24,np.nan,23,25],
    "Blood Group": ['B+','O+','AB+','A+','O-'],
    "Sex Code": [1,1,1,1,1,],
}
df = pd.DataFrame(dct)
df.head()

     name   Age Blood Group  Sex Code
0  Sharif  26.0          B+         1
1   Imran  24.0          O+         1
2   Hanif   NaN         AB+         1
3    Akib  23.0          A+         1
4   Fatin  25.0          O-         1

# append new rows to the bottom by SERIES

In [9]:
new_person = pd.Series(['Kanan Mahmud',30,'B+',1],
                       index=['Name','Age','Blood Group','Sex Code'])

dataframe.append(new_person, ignore_index=True)

           Name   Age Blood Group  Sex Code
0        Sharif  26.0          B+         1
1         Imran  24.0          O+         1
2         Hanif   NaN         AB+         1
3          Akib  23.0          A+         1
4         Fatin  25.0          O-         1
5  Kanan Mahmud  30.0          B+         1

# Describe Dataset

In [10]:
# Show dimensions
dataframe.shape

(5, 4)

In [11]:
# Show statistics
dataframe.describe()

             Age  Sex Code
count   4.000000       5.0
mean   24.500000       1.0
std     1.290994       0.0
min    23.000000       1.0
25%    23.750000       1.0
50%    24.500000       1.0
75%    25.250000       1.0
max    26.000000       1.0

## Calculate Standard Daviation

$SD=\sqrt{\sum_{i=0}^N\frac{(x-\Phi)^2}{N}}$

- $\Phi$ is the mean
- N is Total Number of data
- SD Standard Daviation

# Navigating Data Frame